import React, {Component} from 'react';
import Table_Team from './table/retable_filter.js';
import Table_Team2 from './table/table_games.js';
import {Flex, Box} from 'reflexbox';
import Toggle from "./news/Box";

export default class Team extends Component {
    render() {
        return (
            <Flex  p={1} wrap>
                <Box w={1}>
                    <Table_Team/>
                    <Table_Team2/>
                    <h3>
                        اخبار
                    </h3>
                    <Toggle f={'علی نجیمی'} e={'۱۳ آذر ۱۳۹۷'} a='خبر فوتبال مورد علاقه' b='به گزارش "ورزش سه" و به نقل از پایگاه خبری فوتسال ایران، در حالی که تغییر نسل عجیبی پس از جدایی افتخاری و حضور علی کفاشیان در کمیته فوتسال رخ داد، یکی از دوست داشتنی‌ترین اعضاء این کمیته با حالتی غریبانه خانه‌نشین شد تا کمتر خبری از او به میان آید.
مرتضی درودیان که از داوران باسابقه فوتسال ایران بوده و با رفتار مهربانانه و نوع صحبت کردن دلنشینش محبوب اهالی قدیم و جدید فوتسال است، با اقدام ارزنده صادق درودگر مورد تجلیل قرار گرفت.
صادق درودگر در مراسمی که با حضور جمعی از اهالی فوتسال در تهران برگزار کرد از این مرد زحمتکش روزهای نه چندان دور فوتسال ایران تجلیل کرد و لحظات خوشی را برای وی رقم زد.
گفتنی است درودیان چندی قبل بر اثر حادثه‌ای دچار شکستگی و جراحات شدید در ناحیه سر شده بود که وی را خانه‌نشین کرده بود اما با سری بانداژ شده در میان فوتسالی‌ها حاضر و با مرور خاطراتش با اهالی این رشته شاد شد.' c='football' d={true}/>
                </Box>
            </Flex>
        );
    }
}